---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricWireType
source: html/e492fc52-b8a5-c12f-b73d-2fd1c29a331b.htm
---
# Autodesk.Revit.DB.Structure.FabricWireType

A Fabric Wire Type object that is used in the generation of Fabric Wire.

## Syntax (C#)
```csharp
public class FabricWireType : ElementType
```